---
kind: method
id: M:Autodesk.Revit.DB.GroupSet.GetEnumerator
source: html/f1e2b8b2-1d83-a212-2c5b-1ad388d21fed.htm
---
# Autodesk.Revit.DB.GroupSet.GetEnumerator Method

Retrieve a forward moving iterator to the set.

## Syntax (C#)
```csharp
public virtual IEnumerator GetEnumerator()
```

## Returns
Returns a forward moving iterator to the set.